# Dirrerent ways to creating dataframe

In [7]:
import pandas as pd

### Creating DataFrame from lists of lists.

In [9]:
data = [['tom', 10], ['nick', 15], ['juli', 14]]

In [10]:
df = pd.DataFrame(data, columns = ['Name', 'Age'])

In [11]:
df

   Name  Age
0   tom   10
1  nick   15
2  juli   14

### Creating DataFrame from dict of narray/lists

In [13]:
data = {'Name':['Tom', 'nick', 'krish', 'jack'], 
        'Age':[20, 21, 19, 18]}

In [14]:
df = pd.DataFrame(data)

In [15]:
df

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

### Creating Dataframe from list of dicts

In [18]:
data = [{'a': 1, 'b': 2, 'c':3}, 
        {'a':10, 'b': 20, 'c': 30},
        {'a': 5, 'b': 6, 'c':2}]

In [19]:
df = pd.DataFrame(data)

In [20]:
df

    a   b   c
0   1   2   3
1  10  20  30
2   5   6   2